Revit 2024 API
MathComparisonUtils Class
 This class contains a set of mathematical utilities to compare doubles, using the internal tolerance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static class MathComparisonUtils
Visual Basic
Public NotInheritable Class MathComparisonUtils
Visual C++
public ref class MathComparisonUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MathComparisonUtils
See Also
MathComparisonUtils Members
Autodesk.Revit.DB Namespace